recipes/dal-makhani.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dal Makhani</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Dal Makhani</h1>
<p>
<a href="https://munchingwithmariyah.com/vegan-dal-makhani/">Original link</a>
</p>

<div id="outline-container-org083dff7" class="outline-2">
<h2 id="org083dff7">Ingredients</h2>
<div class="outline-text-2" id="text-org083dff7">
</div>
<div id="outline-container-orgcc63509" class="outline-3">
<h3 id="orgcc63509">Lentils/beans</h3>
<div class="outline-text-3" id="text-orgcc63509">
<ul class="org-ul">
<li>1 cup brown lentils, soaked overnight</li>
<li>1 can kidney beans, drained and rinsed</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7d8e80" class="outline-3">
<h3 id="orgb7d8e80">Aromatics &amp; Spices</h3>
<div class="outline-text-3" id="text-orgb7d8e80">
<ul class="org-ul">
<li>4 tbsp olive oil or avocado oil</li>
<li>1/2 medium white onion, finely chopped**</li>
<li>5 garlic cloves, finely grated</li>
<li>2” piece ginger, finely grated</li>
<li>2 tbsp tomato paste</li>
<li>1 tbsp coconut sugar</li>
<li>2 tsp kosher salt, plus more as needed</li>
<li>2 tsp cumin seeds</li>
<li>1 tsp coriander</li>
<li>1 tsp cayenne pepper</li>
<li>1 tsp black pepper</li>
<li>1/2 tsp ceylon cinnamon</li>
<li>1/2 tsp ground cardamom</li>
<li>1/4 tsp nutmeg</li>
<li>1/4 tsp cloves</li>
</ul>
</div>
</div>

<div id="outline-container-org919a94f" class="outline-3">
<h3 id="org919a94f">Other Ingredients</h3>
<div class="outline-text-3" id="text-org919a94f">
<ul class="org-ul">
<li>1 400 g can crushed tomatoes</li>
<li>1 425 ml can coconut milk</li>
<li>1/2 cup finely chopped cilantro</li>
<li>1–2 tbsp lemon juice</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgbf5ab2d" class="outline-2">
<h2 id="orgbf5ab2d">Instructions</h2>
<div class="outline-text-2" id="text-orgbf5ab2d">
<ol class="org-ol">
<li><b>Rinse the lentils</b>. Rinse the lentils in cold water until the water runs clear. Then soak overnight or at least for 6 hours. This will help the lentils cook faster and help improve the absorption of important nutrients.*</li>
<li><b>Saute the aromatics</b>. Heat a large, deep skillet over medium-high heat and add in the avocado oil or olive oil. Once the oil is shimmering,  add in the onion, and saute until translucent. Next, add in the garlic, ginger, and tomato paste and cook for 3 minutes, stirring frequently to prevent the garlic from burning.</li>
<li><b>Bloom the spices</b>. Add in the coconut sugar, kosher salt, cumin seeds, coriander, cayenne pepper, black pepper, cinnamon, cardamom, nutmeg, and cloves. Cook the spices for 30-60 seconds until fragrant, stirring constantly to prevent burning.</li>
<li><b>Add the remaining ingredients and simmer</b>. Finally, add in the lentils, kidney beans, crushed tomatoes, and coconut milk, and mix well. Reduce the heat to low and partially cover the pan with a lid. Simmer on low heat for 25-30 minutes, or until the lentils are cooked through and have mostly softened. Make sure to stir the dal every 8-10 minutes to ensure it’s not sticking to the bottom of the pan. Once cooked, the curry will thicken and become super creamy. If you find that the lentils are not quite soft after 30 minutes, add a few spoons of water and cook for another 5 minutes.</li>
<li><b>Blend the dal and garnish</b>.Turn off the heat and using an immersion blender, blitz the dal 3-4 times. This will make the dal slightly thicker, and creamier. Finally, stir in the cilantro and lemon juice and adjust the salt as needed.</li>
<li><b>Serve</b>. Serve the dal with rice/flatbread/pita/even sourdough bread and garnish with additional cilantro. Store leftovers in the fridge for 3-4 days.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
